<a href="https://colab.research.google.com/github/sathyanarayanankrishnan/DataScience/blob/main/Pandas_Excercise_Sathya.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Import the pandas library  
Read the data company.csv in pandas

In [37]:
import pandas as pd
url = 'https://raw.githubusercontent.com/balaji2v/Inceptez_Batch19/main/company.csv'
df = pd.read_csv(url)
print (df)

     Company   Age  Salary     Place Country
0        TCS  20.0     NaN   Chennai   India
1    Infosys  30.0     NaN    Mumbai   India
2        TCS  35.0  2300.0  Calcutta   India
3    Infosys  40.0  3000.0     Delhi   India
4        TCS  23.0  4000.0    Mumbai   India
..       ...   ...     ...       ...     ...
144  Infosys  22.0  8787.0  Calcutta   India
145  Infosys  44.0  4034.0     Delhi   India
146      TCS  33.0  5034.0    Mumbai   India
147  Infosys  22.0  8202.0    Cochin   India
148      NaN   NaN     NaN       NaN     NaN

[149 rows x 5 columns]

Find the dimension of given data

In [38]:
print (df.ndim)  # Returns the Dimension of the given data (1D , 2D, 3D etc.,) #2. Return Datatype int  
print (df.shape) # Returns the Shape (Rows and Column Size) #2. Return Datatype tuple
#print (type(df.ndim))
#print (type(df.shape))

2
(149, 5)

List down all the columns in data frame

In [39]:
list_col = df.columns.values.tolist()
print (list_col)

['Company', 'Age', 'Salary', 'Place', 'Country']

List the top 10 rows in datframe

In [40]:
df.head(10)

   Company   Age  Salary     Place Country
0      TCS  20.0     NaN   Chennai   India
1  Infosys  30.0     NaN    Mumbai   India
2      TCS  35.0  2300.0  Calcutta   India
3  Infosys  40.0  3000.0     Delhi   India
4      TCS  23.0  4000.0    Mumbai   India
5  Infosys   NaN  5000.0  Calcutta   India
6      TCS   NaN  6000.0   Chennai   India
7  Infosys  23.0  7000.0    Mumbai   India
8      TCS  34.0  8000.0  Calcutta   India
9      CTS  45.0  9000.0     Delhi   India

List the last 15 rows in datframe

In [41]:
df.tail(15)

                       Company   Age  Salary      Place Country
134  Tata Consultancy Services  31.0  8345.0     Mumbai   India
135                        CTS  40.0  9284.0   Calcutta   India
136                        NaN   NaN     NaN      Delhi   India
137                        CTS  31.0  2034.0     Mumbai   India
138                        CTS  44.0  3033.0     Cochin   India
139                 Congnizant  22.0  2934.0      Noida   India
140                    Infosys  44.0  4034.0  Hyderabad   India
141                        TCS  33.0  5034.0   Calcutta   India
142            Infosys Pvt Lmt  22.0  8202.0     Mumbai   India
143                        TCS  33.0  9024.0   Calcutta   India
144                    Infosys  22.0  8787.0   Calcutta   India
145                    Infosys  44.0  4034.0      Delhi   India
146                        TCS  33.0  5034.0     Mumbai   India
147                    Infosys  22.0  8202.0     Cochin   India
148                        NaN   NaN     NaN        NaN     NaN

Find the number of rows in dataframe

In [42]:
len(df.index)

149

Check the information of dataframe

In [43]:
df.describe

<bound method NDFrame.describe of      Company   Age  Salary     Place Country
0        TCS  20.0     NaN   Chennai   India
1    Infosys  30.0     NaN    Mumbai   India
2        TCS  35.0  2300.0  Calcutta   India
3    Infosys  40.0  3000.0     Delhi   India
4        TCS  23.0  4000.0    Mumbai   India
..       ...   ...     ...       ...     ...
144  Infosys  22.0  8787.0  Calcutta   India
145  Infosys  44.0  4034.0     Delhi   India
146      TCS  33.0  5034.0    Mumbai   India
147  Infosys  22.0  8202.0    Cochin   India
148      NaN   NaN     NaN       NaN     NaN

[149 rows x 5 columns]>

Check the basic Statistics of Dataframe. Give your inference from the stats

In [44]:
df.describe()

              Age       Salary
count  130.000000   124.000000
mean    30.484615  5312.467742
std     11.096640  2573.764683
min      0.000000  1089.000000
25%     22.000000  3030.000000
50%     32.500000  5000.000000
75%     37.750000  8000.000000
max     54.000000  9876.000000

Retrieve 20 to 100 rows and Company and age usig iloc

In [45]:
df.iloc[20:100]

    Company   Age  Salary       Place Country
20      TCS  37.0  3045.0    Calcutta   India
21  Infosys  50.0  3184.0       Delhi   India
22      TCS  21.0  4824.0      Mumbai   India
23  Infosys   NaN  5835.0      Cochin   India
24      TCS   NaN  7084.0     Chennai   India
..      ...   ...     ...         ...     ...
95  Infosys   NaN  5835.0     Chennai   India
96      TCS   NaN  7084.0      Mumbai   India
97  Infosys  22.0  8943.0    Calcutta   India
98      TCS  33.0  8345.0       Delhi   India
99      CTS  44.0  9284.0  Podicherry   India

[80 rows x 5 columns]

Retrieve 20 to 100 rows and Company and age usig loc

In [46]:
df.loc[20:100]

     Company   Age  Salary       Place Country
20       TCS  37.0  3045.0    Calcutta   India
21   Infosys  50.0  3184.0       Delhi   India
22       TCS  21.0  4824.0      Mumbai   India
23   Infosys   NaN  5835.0      Cochin   India
24       TCS   NaN  7084.0     Chennai   India
..       ...   ...     ...         ...     ...
96       TCS   NaN  7084.0      Mumbai   India
97   Infosys  22.0  8943.0    Calcutta   India
98       TCS  33.0  8345.0       Delhi   India
99       CTS  44.0  9284.0  Podicherry   India
100      CTS  22.0     NaN      Cochin   India

[81 rows x 5 columns]

Chage the data in 100 row and Place as 'Noida'

In [47]:
#print (df.iloc[100,3] )
df.iloc[100,3] = 'Noida'
print (df.iloc[100])

Company      CTS
Age         22.0
Salary       NaN
Place      Noida
Country    India
Name: 100, dtype: object

Change the column 'Place' to 'City'

In [48]:
df.rename(columns={'Place':'City'},inplace=True)
df.columns

Index(['Company', 'Age', 'Salary', 'City', 'Country'], dtype='object')

List down the unique data in each columns and find length of unique data

In [49]:
"""
col_list = df.columns.to_list()
print (col_list)
df.columns.unique()
for i in col_list:
  print(df.["[i]"].unique())
"""
for col in df:
    print('Column Name : ',col,'\n','Please find the below are the unique Values,')
    print(df[col].unique(),'\n\n')

Column Name :  Company
 Please find the below are the unique Values,
['TCS' 'Infosys' 'CTS' nan 'Tata Consultancy Services' 'Congnizant'
 'Infosys Pvt Lmt']


Column Name :  Age
 Please find the below are the unique Values,
[20. 30. 35. 40. 23. nan 34. 45. 18. 22. 32. 37. 50. 21. 46. 36. 26. 41.
 24. 25. 43. 19. 38. 51. 31. 44. 33. 17.  0. 54.]


Column Name :  Salary
 Please find the below are the unique Values,
[  nan 2300. 3000. 4000. 5000. 6000. 7000. 8000. 9000. 1089. 1234. 3030.
 3045. 3184. 4824. 5835. 7084. 8943. 8345. 9284. 9876. 2034. 7654. 2934.
 4034. 5034. 8202. 9024. 4345. 6544. 6543. 3234. 4324. 5435. 5555. 8787.
 3454. 5654. 5009. 5098. 3033.]


Column Name :  City
 Please find the below are the unique Values,
['Chennai' 'Mumbai' 'Calcutta' 'Delhi' 'Podicherry' 'Cochin' nan 'Noida'
 'Hyderabad' 'Bhopal' 'Nagpur' 'Pune']


Column Name :  Country
 Please find the below are the unique Values,
['India' nan]

Rename all the possible labels of column in Company as three labels
TCS
CTS
Infosys

In [50]:
df['Company'].replace('Tata Consultancy Services','TCS', regex=True)
df['Company'].replace('Congnizant','CTS', regex=True)
df['Company'].replace('Infosys Pvt Lmt','Infosys', regex=True)

0          TCS
1      Infosys
2          TCS
3      Infosys
4          TCS
        ...
144    Infosys
145    Infosys
146        TCS
147    Infosys
148        NaN
Name: Company, Length: 149, dtype: object

In [51]:
#Where ever you see age as 0 replace with NA

##Hint df[df.Age==20] = np.isnan

In [52]:
df[df.Age==0] = 'NA'

Check how many duplicated data is there?

In [53]:
cnt =0
for i in df.duplicated():
  if i== True : 
    cnt+=1;
print ('Total Count of Duplicates',cnt)

Total Count of Duplicates 13

Remove all duplicated rowise data

In [117]:
df = df.drop_duplicates()
df.drop_duplicates()

             Company   Age  Salary       City
0                TCS  20.0     NaN    Chennai
1            Infosys  30.0     NaN     Mumbai
2                TCS  35.0  2300.0   Calcutta
3            Infosys  40.0  3000.0      Delhi
4                TCS  23.0  4000.0     Mumbai
..               ...   ...     ...        ...
140          Infosys  44.0  4034.0  Hyderabad
141              TCS  33.0  5034.0   Calcutta
142  Infosys Pvt Lmt  22.0  8202.0     Mumbai
143              TCS  33.0  9024.0   Calcutta
148              TCS  22.0     NaN        NaN

[136 rows x 4 columns]

Remove the column 'Country'

In [116]:
df.drop(inplace=True,axis=0,columns='Country')

Remove the row number 137

In [115]:
df.drop(137)

     Company   Age  Salary      City Country
0        TCS  20.0     NaN   Chennai   India
1    Infosys  30.0     NaN    Mumbai   India
2        TCS  35.0  2300.0  Calcutta   India
3    Infosys  40.0  3000.0     Delhi   India
4        TCS  23.0  4000.0    Mumbai   India
..       ...   ...     ...       ...     ...
144  Infosys  22.0  8787.0  Calcutta   India
145  Infosys  44.0  4034.0     Delhi   India
146      TCS  33.0  5034.0    Mumbai   India
147  Infosys  22.0  8202.0    Cochin   India
148      TCS  22.0     NaN       NaN     NaN

[148 rows x 5 columns]

Find number of each labels in Company

In [112]:
df.Company.unique()

array(['TCS', 'Infosys', 'CTS', 'Tata Consultancy Services', 'Congnizant',
       'Infosys Pvt Lmt', 'NA'], dtype=object)

Find number of each labels in City

In [113]:
df.City.unique()

array(['Chennai', 'Mumbai', 'Calcutta', 'Delhi', 'Podicherry', 'Cochin',
       nan, 'Noida', 'Hyderabad', 'Bhopal', 'Nagpur', 'Pune', 'NA'],
      dtype=object)

Find Number of Null Values in each column

In [114]:
df.isna().sum().sum()

41

Remove all Null values in Salary

In [140]:
df.dropna(subset=['Salary'])
df.dropna(subset=['Age'])

             Company   Age  Salary       City
0                TCS  20.0  3000.0    Chennai
1            Infosys  30.0  3000.0     Mumbai
2                TCS  35.0  2300.0   Calcutta
3            Infosys  40.0  3000.0      Delhi
4                TCS  23.0  4000.0     Mumbai
..               ...   ...     ...        ...
140          Infosys  44.0  4034.0  Hyderabad
141              TCS  33.0  5034.0   Calcutta
142  Infosys Pvt Lmt  22.0  8202.0     Mumbai
143              TCS  33.0  9024.0   Calcutta
148              TCS  22.0  3000.0        NaN

[136 rows x 4 columns]

Replace the Null values in Comapany with mode

In [141]:
df['Company'] = df['Company'].fillna(df['Company'].mode()[0]) 
print (df)

             Company   Age  Salary       City
0                TCS  20.0  3000.0    Chennai
1            Infosys  30.0  3000.0     Mumbai
2                TCS  35.0  2300.0   Calcutta
3            Infosys  40.0  3000.0      Delhi
4                TCS  23.0  4000.0     Mumbai
..               ...   ...     ...        ...
140          Infosys  44.0  4034.0  Hyderabad
141              TCS  33.0  5034.0   Calcutta
142  Infosys Pvt Lmt  22.0  8202.0     Mumbai
143              TCS  33.0  9024.0   Calcutta
148              TCS  22.0  3000.0        NaN

[136 rows x 4 columns]

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

Replace the null value in Salary with median

In [142]:
df['Salary'] = df['Salary'].fillna(df['Salary'].mode()[0])
print (df)

             Company   Age  Salary       City
0                TCS  20.0  3000.0    Chennai
1            Infosys  30.0  3000.0     Mumbai
2                TCS  35.0  2300.0   Calcutta
3            Infosys  40.0  3000.0      Delhi
4                TCS  23.0  4000.0     Mumbai
..               ...   ...     ...        ...
140          Infosys  44.0  4034.0  Hyderabad
141              TCS  33.0  5034.0   Calcutta
142  Infosys Pvt Lmt  22.0  8202.0     Mumbai
143              TCS  33.0  9024.0   Calcutta
148              TCS  22.0  3000.0        NaN

[136 rows x 4 columns]

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

Replace the null value in age with mean

In [143]:
df['Age'] = df['Age'].fillna(df['Age'].mode()[0])
print(df['Age'])

0      20.0
1      30.0
2      35.0
3      40.0
4      23.0
       ...
140    44.0
141    33.0
142    22.0
143    33.0
148    22.0
Name: Age, Length: 136, dtype: object

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

Filter the data with age>40 and Salary<5000

In [148]:
df
df['Age'] = df['Age'].fillna(df['Age'].mode()[0])
print(df.Age)
df['Age'] = df['Age'].astype(float, errors = 'raise')
res = df.loc[(df['Age'] > 40) ]
print(res)

0      20.0
1      30.0
2      35.0
3      40.0
4      23.0
       ...
140    44.0
141    33.0
142    22.0
143    33.0
148    22.0
Name: Age, Length: 136, dtype: object

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

ValueError: ignored

Draw the pie chart for place and Company

In [135]:
df.hist(['Age','Salary'])

ValueError: ignored

Find the mean age with repective to the Company

In [146]:
df.groupby('Company')['Age'].mean()

TypeError: ignored

Draw an histogram chart for age, Salary

In [55]:
df.groupby('Salary')['Age'].count()

Find the mean, count, median of salary with repective to the place

In [147]:
df.groupby('Salary')['Age'].count()

Salary
1089.0     4
1234.0     3
2034.0     3
2300.0     4
2934.0     4
3000.0    33
3030.0     2
3033.0     1
3045.0     3
3184.0     4
3234.0     1
3454.0     1
4000.0     2
4034.0     4
4324.0     1
4345.0     1
4824.0     3
5000.0     6
5009.0     1
5034.0     4
5098.0     1
5435.0     1
5555.0     1
5654.0     1
5835.0     3
6000.0     3
6543.0     1
6544.0     1
7000.0     3
7084.0     4
7654.0     2
8000.0     3
8202.0     4
8345.0     4
8787.0     2
8943.0     4
9000.0     3
9024.0     3
9284.0     4
9876.0     2
NA         1
Name: Age, dtype: int64

In [56]:
############### Performance Check (Additional)
from timeit import default_timer
start_time = default_timer()
len(df) 
end_time = default_timer()
diff = end_time-start_time
print (diff*100000)

start_time = default_timer()
len(df.index)
end_time = default_timer()
diff = end_time-start_time
print (diff*100000)

len(df.index) #-- Expected to have imporved Performance compared to Above len(df)

9.026899988384685
8.454599992546719

149

However for smaller dataset it looks len(df) is faster however for a larger dataset it is good to go with index usage.